app/controllers/posts_controller.rb

    def show
        #fix step 1
        #expected to find css "h1" with text "My Post" but there were no matches
        @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]